const config = {
    imagePath: 'images/front-upper-body.jpg',
    imageWidth: 720,
    imageHeight: 960,
    acupoints: [
        { name: '神阙', x: 388, y: 667, desc: '在腹中部，脐中央。' },
        { name: '水分', x: 390, y: 645, desc: '在上腹部，前正中线上，当脐中上1寸。' },
        { name: '下脘', x: 390, y: 622, desc: '在上腹部，前正中线上，当脐中上2寸。' },
        { name: '建里', x: 392, y: 600, desc: '在上腹部，前正中线上，当脐中上3寸。' },
        { name: '中脘', x: 394, y: 579, desc: '在上腹部，前正中线上，当脐中上4寸。' },
        { name: '上脘', x: 397, y: 556, desc: '在上腹部，前正中线上，当脐中上5寸。' },
        { name: '巨阙', x: 400, y: 536, desc: '在上腹部，前正中线上，当脐中上6寸。' },
        { name: '鸠尾', x: 400, y: 514, desc: '在上腹部，前正中线上，当胸剑结合部下1寸。' },
        { name: '中庭', x: 402, y: 492, desc: '在胸部，当前正中线上，平第5肋间，即胸剑结合部。' },
        { name: '膻中', x: 405, y: 472, desc: '在胸部，当前正中线上，平第4肋间，两乳头连线的中点。' },
        { name: '玉堂', x: 0, y: 0, desc: '在胸部，当前正中线上，平第3肋间。' },
        { name: '紫宫', x: 409, y: 428, desc: '在胸部，当前正中线上，平第2肋间。' },
        { name: '华盖', x: 413, y: 383, desc: '在胸部，当前正中线上，平第1肋间。' },
        { name: '璇玑', x: 416, y: 339, desc: '在胸部，当前正中线上，天突下1寸。' },
        { name: '天突', x: 416, y: 325, desc: '在颈部，当前正中线上，胸骨上窝中央。' },
        { name: '廉泉', x: 413, y: 250, desc: '在颈部，当前正中线上，结喉上方，舌骨上缘凹陷处。' },
        { name: '承浆', x: 407, y: 227, desc: '在面部，当颏唇沟的正中凹陷处。' },
        { name: '阴交', x: 385, y: 689, desc: '在下腹部，前正中线上，当脐中下1寸。' },
        { name: '气海', x: 384, y: 700, desc: '在下腹部，前正中线上，当脐中下1.5寸。' },
        { name: '石门', x: 384, y: 711, desc: '在下腹部，前正中线上，当脐中下2寸。' },
        { name: '关元', x: 382, y: 734, desc: '在下腹部，前正中线上，当脐中下3寸。' },
        { name: '中极', x: 379, y: 755, desc: '在下腹部，前正中线上，当脐中下4寸。' },
        { name: '曲骨', x: 377, y: 777, desc: '在下腹部，当前正中线上，耻骨联合上缘的中点处。' },
        { name: '会阴', x: 362, y: 855, desc: '位于会阴部，男性在阴囊根部与肛门连线的中点，女性在大阴唇后联合与肛门连线的中点。' }
    ],
    gameSettings: {
        initialScore: 0,
        correctPointBonus: 1,
        wrongPointPenalty: -1,
        clickRadius: 20 // 点击判定半径
    }
}; 